app/controllers/welcome_controller.rb

  def index


    if params[:date1].present?

        @date = params[:date1]
        date=DateTime.parse(@date)
        date1= date + 20.minutes
        @sdata  =Wlog.where('Time <= ? and Time >= ?', date1, date).where("rt> 1 AND methods='GET'").order("RT DESC")
        @data  =Wlog.group(:Time).where('Time <= ? and Time >= ?', date1, date).count
        @data6= Wlog.group(:Methods).where('Time <= ? and Time >= ?', date1, date).average(:rt)

        @data4= Wlog.group(:Time).where('Time <= ? and Time >= ?', date1, date).average(:rt)
---
SELECT AVG(rt) AS average_rt, `wlogs`.`Methods` AS wlogs_methods FROM `wlogs` WHERE (Time <= '2021-04-20 19:11:00' and Time >= '2021-04-20 18:51:00') GROUP BY `wlogs`.`Methods`
SELECT `wlogs`.* FROM `wlogs` WHERE (Time <= '2021-04-20 19:11:00' and Time >= '2021-04-20 18:51:00') AND (rt> 1 AND methods='GET') ORDER BY RT DESC
SELECT COUNT(*) AS count_all, `wlogs`.`Time` AS wlogs_time FROM `wlogs` WHERE (Time <= '2021-04-20 19:11:00' and Time >= '2021-04-20 18:51:00') GROUP BY `wlogs`.`Time`
SELECT `wlogs`.`Time` FROM `wlogs` WHERE (Time <= '2021-04-20 19:11:00' and Time >= '2021-04-20 18:51:00') GROUP BY `wlogs`.`Time`
SELECT AVG(rt) AS average_rt, `wlogs`.`Time` AS wlogs_time FROM `wlogs` WHERE (Time <= '2021-04-20 19:11:00' and Time >= '2021-04-20 18:51:00') GROUP BY `wlogs`.`Time`