app/models/wlog.rb

 def self.apdex(date, date1)
   hash= {}
   data= Wlog.group(:Time).where('Time <= ? and Time >= ?', date1, date).select(:Time)
   data1= Wlog.group(:Time).where('Time <= ? and Time >= ?', date1, date).count
   data2= Wlog.group(:Time).where('Time <= ? and Time >= ?', date1, date).where("RT <=0.03").count
   data3= Wlog.group(:Time).where('Time <= ? and Time >= ?', date1, date).where("RT > 0.03 AND RT < 0.12 ").count


 data.each do |i|
---
SELECT COUNT(*) AS count_all, `wlogs`.`Time` AS wlogs_time FROM `wlogs` WHERE (Time <= '2021-04-20 19:11:00' and Time >= '2021-04-20 18:51:00') GROUP BY `wlogs`.`Time`
SELECT COUNT(*) AS count_all, `wlogs`.`Time` AS wlogs_time FROM `wlogs` WHERE (Time <= '2021-04-20 19:11:00' and Time >= '2021-04-20 18:51:00') AND (RT <=0.03) GROUP BY `wlogs`.`Time`
SELECT COUNT(*) AS count_all, `wlogs`.`Time` AS wlogs_time FROM `wlogs` WHERE (Time <= '2021-04-20 19:11:00' and Time >= '2021-04-20 18:51:00') AND (RT > 0.03 AND RT < 0.12 ) GROUP BY `wlogs`.`Time`
SELECT `wlogs`.`Time` FROM `wlogs` WHERE (Time <= '2021-04-20 19:11:00' and Time >= '2021-04-20 18:51:00') GROUP BY `wlogs`.`Time`